{
    "given_information": {
        "text_entered": "I'm researching environmental regulations. Can you summarize the Clean Air Act and its objectives with details.",
        "uploads": [
            {
                "file_name": "Case document.pdf",
                "uploaded": 5
            }
        ]
    },
    "questions": {
        "by_petitioner": [
            {
                "question": "Was the dog on a leash or under the control of the owner at the time of the incident?",
                "reason": "This question aims to establish whether the owner was negligent in controlling the dog, which is crucial for proving liability."
            },
            {
                "question": "Did the dog show any signs of aggression or previous violent behavior before the incident?",
                "reason": "This question is important to demonstrate the owner’s knowledge of the dog’s aggressive tendencies, which can support the claim of negligence."
            },
            {
                "question": "Were there any warning signs or notices indicating the presence of a dangerous dog on the owner’s property?",
                "reason": "This question seeks to determine if the owner took reasonable precautions to warn others about the potential danger posed by the dog."
            },
            {
                "question": "Has the dog been involved in similar incidents of biting or aggression in the past?",
                "reason": "This question is relevant to establish a pattern of behavior and the owner’s awareness of the dog’s propensity for aggression."
            },
            {
                "question": "Did the owner take immediate steps to assist or provide medical aid to the victim after the dog bite incident?",
                "reason": "This question addresses the owner’s duty of care and responsibility towards the victim following the incident."
            },
            {
                "question": "Can you provide any evidence of communication or interaction with the owner regarding the dog’s behavior prior to the incident?",
                "reason": "This question seeks to uncover any previous warnings or discussions about the dog’s aggressive behavior."
            }
        ],
        "by_respondent": [
            {
                "question": "Was the victim trespassing on the property at the time of the incident?",
                "reason": "This question is aimed at determining whether the victim had a legal right to be on the property, which could influence liability."
            },
            {
                "question": "Did the victim provoke the dog in any way leading up to the incident?",
                "reason": "This question seeks to establish if the victim’s actions may have contributed to the dog’s aggressive response."
            },
            {
                "question": "Was the dog trained for protection or as a guard dog?",
                "reason": "This question is important to understand the dog’s purpose and training, which may impact the owner’s responsibility."
            },
            {
                "question": "Was there a fence or other barrier preventing the dog from leaving the owner’s property?",
                "reason": "This question aims to determine if the owner took measures to contain the dog and prevent it from interacting with others."
            },
            {
                "question": "Has the dog completed any obedience or behavior training programs?",
                "reason": "This question seeks to understand if the owner attempted to manage or mitigate the dog’s aggressive tendencies through training."
            },
            {
                "question": "Did the owner post any signs warning about the dog on the property?",
                "reason": "This question aims to determine if the owner provided adequate warning to others about the presence of a potentially dangerous dog."
            }
        ]
    }
}